Revit 2027 API
RebarBendingDetailType.TagTypeId Property
 Identifies the Id of the tag type which is used in the Bending Detail representation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TagTypeId { get; set; }
Public Property TagTypeId As ElementId
	Get
	Set
public:
property ElementId^ TagTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TagTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property:
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace